* Day 8: Resonant Collinearity

You find yourselves on the roof of a top-secret Easter Bunny installation.

While The Historians do their thing, you take a look at the familiar huge
antenna. Much to your surprise, it seems to have been reconfigured to emit a
signal that makes people 0.1% more likely to buy Easter Bunny brand Imitation
Mediocre Chocolate as a Christmas gift! Unthinkable!

Scanning across the city, you find that there are actually many such antennas.
Each antenna is tuned to a specific frequency indicated by a single lowercase
letter, uppercase letter, or digit. You create a map (your puzzle input) of
these antennas. For example:

#+begin_example
............
........0...
.....0......
.......0....
....0.......
......A.....
............
............
........A...
.........A..
............
............
#+end_example

The signal only applies its nefarious effect at specific antinodes based on the
resonant frequencies of the antennas. In particular, an antinode occurs at any
point that is perfectly in line with two antennas of the same frequency - but
only when one of the antennas is twice as far away as the other. This means that
for any pair of antennas with the same frequency, there are two antinodes, one
on either side of them.

So, for these two antennas with frequency a, they create the two antinodes
marked with #:

#+begin_example
..........
...#......
..........
....a.....
..........
.....a....
..........
......#...
..........
..........
#+end_example

Adding a third antenna with the same frequency creates several more antinodes.
It would ideally add four antinodes, but two are off the right side of the map,
so instead it adds only two:

#+begin_example
..........
...#......
#.........
....a.....
........a.
.....a....
..#.......
......#...
..........
..........
#+end_example

Antennas with different frequencies don't create antinodes; A and a count as
different frequencies. However, antinodes can occur at locations that contain
antennas. In this diagram, the lone antenna with frequency capital A creates no
antinodes but has a lowercase-a-frequency antinode at its location:

#+begin_example
..........
...#......
#.........
....a.....
........a.
.....a....
..#.......
......A...
..........
..........
#+end_example

The first example has antennas with two different frequencies, so the antinodes
they create look like this, plus an antinode overlapping the topmost A-frequency
antenna:

#+begin_example
......#....#
...#....0...
....#0....#.
..#....0....
....0....#..
.#....A.....
...#........
#......#....
........A...
.........A..
..........#.
..........#.
#+end_example

Because the topmost A-frequency antenna overlaps with a 0-frequency antinode,
there are 14 total unique locations that contain an antinode within the bounds
of the map.

Calculate the impact of the signal. How many unique locations within the bounds
of the map contain an antinode?




#+name: task08_1
#+header: :var fndata="data.txt"
#+begin_src ruby
  $dbg = ""

  up =    [0,-1]
  down =  [0,1]
  left =  [-1,0]
  right = [1,0]

  def move( a, b )
    return [ a[0]+b[0], a[1]+b[1] ]
  end

  def obstacle?( obstacles, p )
    return obstacles.include?( p )
  end

  def off_map?( p, mapsize )
    if p[0] < 0 or p[1] < 0 or p[0] >= mapsize[0] or p[1] >= mapsize[1]
      return true
    end
    return false
  end

  def viz_map( map_size, antennas, antinodes )
    m = [];

    map_size[1].times do
      m.append "." * map_size[0]
    end

    antennas.each do |a, p|
      p.each do |i|
        m[i[1]][i[0]] = a
      end
    end

    antinodes.each do |s|
      m[s[1]][s[0]] = '#'
    end

    m.join("\n") + "\n"
  end

  raw_data = File.read(fndata)

  sum = 0

  antennas = {}
  antinodes = []
  map_size = [raw_data.lines[0].length-1,raw_data.lines.length]

  raw_data.each_line.with_index do |l,y|
    l.each_char.with_index do |c,x|
      case c
          when 'a'..'z', 'A'..'Z', '0'..'9'
            if antennas[c] == nil
              antennas[c] = [ [x,y] ]
            else
              antennas[c].append [x,y]
            end
          when '.', "\n", "\r"
            # nothing
          else
            $dbg += "Found undefined map symbol '#{c}'\n"
      end
    end
  end

  $dbg += viz_map( map_size, antennas, antinodes )
  $dbg += "Antennas  #{antennas}\n"
  $dbg += "Map size  #{map_size}\n"

  calc = 0
  antennas.each do |a, positions|
    positions.each do |p1|
      positions.each do |p2|
        dx = p2[0] - p1[0]
        dy = p2[1] - p1[1]
        ax = p1[0] - dx
        ay = p1[1] - dy
        if dx != 0 and dy != 0
          antinodes.append [ax,ay] if not off_map?( [ax,ay], map_size ) and not antinodes.include? [ax,ay] #and calc < 5
          calc += 1
          #$dbg += "  found #{a} #{p1} #{p2} -> #{[dx,dy]} => #{[ax,ay]}\n"
        end
      end
    end
  end

  $dbg += viz_map( map_size, antennas, antinodes )
  $dbg += "antinodes #{antinodes}\n"
  $dbg += "result    #{antinodes.length}\n"

  $dbg
#+end_src

#+RESULTS: task08_1
#+begin_example
.........................p........................
......................h....C............M.........
..............................p....U..............
..5..................p............................
..6z...........................................C..
...............c...........zV.....................
...5.....c........................................
.Z.............h........S...z....9................
.O............................9...z........M..C...
..O....5..............................F..M..C.....
..Z.........5.c...............M....V..............
........ZO................q.......................
s...O................h..Uq.....7V...........4.....
.q.g..............c.............p.......4.........
............hZ.............................4G.....
6s...........................U.Q.....3............
.......6.................9.......Q.............3..
....s..D.........................6................
.............................................FL...
..................................................
..g...D.........q.....f.......Q...F....L......7...
...............2.........f.............V.L...4....
...................2.s...................f3......G
....g...........................v......7P.........
..2..g.............d.....v...........P.......1....
..............u.........f.............L........G..
.........l.D....u...............d........o..P.....
..................8...............9..1......o...7.
............l.....................................
...................l...S...........F.......o..U...
.......................u...S......................
..........l....u...............m...........P....G.
......................................1.8.......o.
..................................................
..................v.......S................0......
.............v........d.....1.....................
..................................................
..........D....................................0..
...................m.............H..........0.....
...................................d......0.......
..................................................
....Q.............................................
................................H.................
........................H....................8....
..................................................
..................................................
.........................................8........
.......................H3.........................
............................m.....................
................................m.................
Antennas  {"p"=>[[25, 0], [30, 2], [21, 3], [32, 13]], "h"=>[[22, 1], [15, 7], [21, 12], [12, 14]], "C"=>[[27, 1], [47, 4], [46, 8], [44, 9]], "M"=>[[40, 1], [43, 8], [41, 9], [30, 10]], "U"=>[[35, 2], [24, 12], [29, 15], [46, 29]], "5"=>[[2, 3], [3, 6], [7, 9], [12, 10]], "6"=>[[2, 4], [0, 15], [7, 16], [33, 17]], "z"=>[[3, 4], [27, 5], [28, 7], [34, 8]], "c"=>[[15, 5], [9, 6], [14, 10], [18, 13]], "V"=>[[28, 5], [35, 10], [32, 12], [39, 21]], "Z"=>[[1, 7], [2, 10], [8, 11], [13, 14]], "S"=>[[24, 7], [23, 29], [27, 30], [26, 34]], "9"=>[[33, 7], [30, 8], [25, 16], [34, 27]], "O"=>[[1, 8], [2, 9], [9, 11], [4, 12]], "F"=>[[38, 9], [45, 18], [34, 20], [35, 29]], "q"=>[[26, 11], [25, 12], [1, 13], [16, 20]], "s"=>[[0, 12], [1, 15], [4, 17], [21, 22]], "7"=>[[31, 12], [46, 20], [39, 23], [48, 27]], "4"=>[[44, 12], [40, 13], [43, 14], [45, 21]], "g"=>[[3, 13], [2, 20], [4, 23], [5, 24]], "G"=>[[44, 14], [49, 22], [47, 25], [48, 31]], "Q"=>[[31, 15], [33, 16], [30, 20], [4, 41]], "3"=>[[37, 15], [47, 16], [42, 22], [24, 47]], "D"=>[[7, 17], [6, 20], [11, 26], [10, 37]], "L"=>[[46, 18], [39, 20], [41, 21], [38, 25]], "f"=>[[22, 20], [25, 21], [41, 22], [24, 25]], "2"=>[[15, 21], [19, 22], [2, 24]], "v"=>[[32, 23], [25, 24], [18, 34], [13, 35]], "P"=>[[40, 23], [37, 24], [44, 26], [43, 31]], "d"=>[[19, 24], [32, 26], [22, 35], [35, 39]], "1"=>[[45, 24], [37, 27], [38, 32], [28, 35]], "u"=>[[14, 25], [16, 26], [23, 30], [15, 31]], "l"=>[[9, 26], [12, 28], [19, 29], [10, 31]], "o"=>[[41, 26], [44, 27], [43, 29], [48, 32]], "8"=>[[18, 27], [40, 32], [45, 43], [41, 46]], "m"=>[[31, 31], [19, 38], [28, 48], [32, 49]], "0"=>[[43, 34], [47, 37], [44, 38], [42, 39]], "H"=>[[33, 38], [32, 42], [24, 43], [23, 47]]}
Map size  [50, 50]
.#..............#.#..#...p.....#...#............#.
............#.........h#...C...........#M.........
.#..#....#..........#.........p....U#.............
..#..................p...##..............#.#......
#.6z........#...#....#............##...........C..
...............c#..........zV......#..............
#..5#....c.......#....#.............#..#..........
#Z.#......#....h........S...z....9.......#...#..#.
.O##..........................9.#.z...#....M..C...
..O##..5...........#.......#.#........F.#M..C.....
..Z#........5.#............#..#.#..V...#..#..#....
........ZO.......#.#......q......#.......#......##
s...O......#..#..#...h..Uq.....7V...##......4##...
.q.#....#.......#.c.....#....##.p....#..4...#.....
.#......#...hZ...#.#.#.....#.#..#.#.#....#.4G.....
6s....#.....##.#....#........U.Q.....#..#.#...#...
...#...#..............#..9.......Q........#....3..
#...s..D......#...#...#...##...#.6.#......#.#.....
..##....................#...#.....#....#.....FL...
.......#.....#.....##.........#.....##........#...
..g..#D..#.#....q.....f....#..Q...#.#..L......7...
........##.....2.#...#...#.........#...V.L...#....
...#..#.##...#.....2.s.#....#.#.#...#..##f3#.....G
....g#..............#..#........v......#P..#......
..2..g#.....#......d#....v.#......#.#P.....#.1....
......#.......#..##.....f....#....#...#......#.G..
......#..l.D....u...........#...#.....##.o..P.....
.##..##...........#.........#..#..9..1#.....o...7.
.......##.#.#......#...#.............#.......#.#..
......#............l...#.......#...#.....#.##.U##.
...............#.......u..#S.#.......#....#...#...
.........#l....u..............##.......#..#P....G.
.......#........#............##.......1.8.##.#..o.
.#...#.................#..................#.......
........#.........v.......S...#...#........0...#..
.......#.....v.#......d.....1...#.................
........#..#..#...........................#.......
..........D.....#......................#.#....#0.#
..................#m.....#.......H..#......#0....#
.........................#...#.....d.....#0...#...
.........................#.....#........#......#.#
....Q................................#..#.........
................................H............#....
...................#....H....................8..#.
...........##...#........................#........
....#..#..........................................
.#.........#.............#.....#......#..8........
.......................H#..........#..............
.........#.....#............m.....................
................................#....#............
antinodes [[35, 4], [39, 1], [17, 6], [12, 4], [39, 26], [34, 24], [43, 23], [8, 13], [9, 2], [18, 0], [20, 23], [27, 17], [30, 10], [2, 27], [9, 21], [3, 16], [48, 0], [45, 12], [48, 7], [41, 14], [42, 10], [46, 15], [45, 7], [42, 17], [39, 10], [20, 19], [17, 12], [19, 11], [13, 22], [19, 9], [23, 28], [34, 18], [12, 1], [1, 0], [4, 9], [12, 15], [11, 12], [2, 8], [22, 17], [21, 14], [17, 11], [12, 28], [14, 17], [26, 3], [20, 2], [29, 9], [22, 6], [41, 11], [40, 9], [21, 4], [16, 0], [3, 7], [4, 2], [13, 15], [19, 14], [10, 7], [21, 21], [27, 20], [22, 16], [21, 0], [42, 15], [38, 8], [36, 19], [29, 14], [25, 3], [43, 32], [46, 30], [0, 4], [3, 13], [15, 15], [14, 12], [3, 8], [25, 21], [24, 18], [18, 17], [19, 28], [20, 24], [31, 31], [28, 26], [29, 39], [25, 38], [36, 6], [27, 9], [35, 0], [17, 25], [16, 5], [35, 47], [38, 46], [43, 38], [0, 7], [3, 10], [0, 6], [17, 14], [16, 13], [14, 10], [7, 16], [6, 15], [31, 0], [30, 31], [23, 22], [33, 11], [32, 49], [25, 40], [36, 38], [27, 10], [36, 2], [24, 13], [49, 11], [34, 4], [6, 29], [7, 28], [31, 27], [2, 18], [8, 22], [7, 19], [42, 32], [41, 29], [38, 27], [16, 4], [23, 1], [44, 13], [47, 34], [32, 26], [30, 19], [48, 11], [45, 10], [43, 3], [36, 14], [37, 12], [35, 5], [42, 16], [41, 7], [47, 28], [4, 6], [2, 3], [1, 2], [1, 27], [0, 17], [5, 33], [6, 26], [3, 22], [7, 35], [8, 28], [6, 25], [39, 6], [41, 3], [45, 28], [46, 19], [47, 40], [49, 37], [32, 10], [35, 17], [36, 12], [29, 25], [27, 24], [27, 14], [32, 8], [47, 29], [37, 28], [8, 14], [5, 23], [1, 14], [15, 35], [16, 32], [9, 48], [32, 22], [37, 19], [40, 15], [36, 24], [43, 22], [44, 17], [30, 32], [37, 30], [35, 29], [19, 19], [3, 18], [20, 15], [28, 22], [9, 20], [26, 17], [26, 30], [23, 29], [11, 20], [28, 18], [23, 23], [36, 20], [39, 22], [46, 12], [18, 25], [32, 14], [37, 13], [4, 45], [11, 44], [23, 33], [1, 46], [8, 36], [37, 15], [34, 25], [30, 22], [31, 17], [48, 29], [45, 21], [46, 39], [49, 38], [42, 36], [6, 22], [3, 9], [29, 13], [25, 46], [12, 44], [9, 31], [48, 43], [29, 30], [36, 22], [31, 40], [39, 37], [11, 46], [19, 43], [18, 38], [12, 24], [5, 20], [13, 19], [18, 27], [9, 22], [17, 21], [32, 35], [30, 34], [31, 29], [16, 37], [14, 36], [7, 32], [6, 24], [8, 21], [15, 30], [5, 27], [14, 25], [29, 32], [28, 27], [11, 36], [8, 34], [1, 33], [38, 25], [39, 23], [34, 20], [45, 25], [40, 22], [45, 32], [42, 31], [38, 26], [35, 21], [39, 18], [49, 40], [37, 49], [43, 24], [34, 14], [30, 13], [7, 45], [10, 28], [6, 27], [24, 47], [39, 31], [42, 30], [44, 29], [45, 42], [41, 39], [46, 37], [41, 44], [37, 41], [40, 40], [34, 34], [42, 33], [43, 29], [31, 46], [40, 41], [41, 37], [15, 48], [16, 44], [25, 39]]
result    278
#+end_example

** Part Two ---
Watching over your shoulder as you work, one of The Historians asks if you took
the effects of resonant harmonics into your calculations.

Whoops!

After updating your model, it turns out that an antinode occurs at any grid
position exactly in line with at least two antennas of the same frequency,
regardless of distance. This means that some of the new antinodes will occur at
the position of each antenna (unless that antenna is the only one of its
frequency).

So, these three T-frequency antennas now create many antinodes:

#+begin_example
T....#....
...T......
.T....#...
.........#
..#.......
..........
...#......
..........
....#.....
..........
#+end_example

In fact, the three T-frequency antennas are all exactly in line with two
antennas, so they are all also antinodes! This brings the total number of
antinodes in the above example to 9.

The original example now has 34 antinodes, including the antinodes that appear
on every antenna:

#+begin_example
##....#....#
.#.#....0...
..#.#0....#.
..##...0....
....0....#..
.#...#A....#
...#..#.....
#....#.#....
..#.....A...
....#....A..
.#........#.
...#......##
#+end_example

Calculate the impact of the signal using this updated model. How many unique
locations within the bounds of the map contain an antinode?

#+name: task08_2
#+header: :var fndata="data.txt"
#+begin_src ruby
  $dbg = ""

  up =    [0,-1]
  down =  [0,1]
  left =  [-1,0]
  right = [1,0]

  def move( a, b )
    return [ a[0]+b[0], a[1]+b[1] ]
  end

  def move_reverse( a, b )
    return [ a[0]-b[0], a[1]-b[1] ]
  end

  def obstacle?( obstacles, p )
    return obstacles.include?( p )
  end

  def off_map?( p, mapsize )
    if p[0] < 0 or p[1] < 0 or p[0] >= mapsize[0] or p[1] >= mapsize[1]
      return true
    end
    return false
  end

  def viz_map( map_size, antennas, antinodes )
    m = [];

    map_size[1].times do
      m.append "." * map_size[0]
    end

    antennas.each do |a, p|
      p.each do |i|
        m[i[1]][i[0]] = a
      end
    end

    antinodes.each do |s|
      m[s[1]][s[0]] = '#'
    end

    m.join("\n") + "\n"
  end

  raw_data = File.read(fndata)

  sum = 0

  antennas = {}
  antinodes = []
  map_size = [raw_data.lines[0].length-1,raw_data.lines.length]

  raw_data.each_line.with_index do |l,y|
    l.each_char.with_index do |c,x|
      case c
          when 'a'..'z', 'A'..'Z', '0'..'9'
            if antennas[c] == nil
              antennas[c] = [ [x,y] ]
            else
              antennas[c].append [x,y]
            end
          when '.', "\n", "\r"
            # nothing
          else
            $dbg += "Found undefined map symbol '#{c}'\n"
      end
    end
  end

  $dbg += viz_map( map_size, antennas, antinodes )
  $dbg += "Antennas  #{antennas}\n"
  $dbg += "Map size  #{map_size}\n"

  calc = 0
  antennas.each do |a, positions|
    positions.each do |p1|
      positions.each do |p2|
        d = [p2[0] - p1[0], p2[1] - p1[1]]
        np = [p1[0] , p1[1]]
        if d[0] != 0 and d[1] != 0
          until off_map?( np, map_size )
            antinodes.append np if not antinodes.include? np #and calc < 5
            calc += 1
            #$dbg += "  found #{a} #{p1} #{p2} -> #{d} => #{np}\n"
            np = move_reverse( np, d )
          end
        end
      end
    end
  end

  $dbg += viz_map( map_size, antennas, antinodes )
  $dbg += "antinodes #{antinodes}\n"
  $dbg += "result    #{antinodes.length}\n"

  $dbg
#+end_src

#+RESULTS: task08_2
#+begin_example
.........................p........................
......................h....C............M.........
..............................p....U..............
..5..................p............................
..6z...........................................C..
...............c...........zV.....................
...5.....c........................................
.Z.............h........S...z....9................
.O............................9...z........M..C...
..O....5..............................F..M..C.....
..Z.........5.c...............M....V..............
........ZO................q.......................
s...O................h..Uq.....7V...........4.....
.q.g..............c.............p.......4.........
............hZ.............................4G.....
6s...........................U.Q.....3............
.......6.................9.......Q.............3..
....s..D.........................6................
.............................................FL...
..................................................
..g...D.........q.....f.......Q...F....L......7...
...............2.........f.............V.L...4....
...................2.s...................f3......G
....g...........................v......7P.........
..2..g.............d.....v...........P.......1....
..............u.........f.............L........G..
.........l.D....u...............d........o..P.....
..................8...............9..1......o...7.
............l.....................................
...................l...S...........F.......o..U...
.......................u...S......................
..........l....u...............m...........P....G.
......................................1.8.......o.
..................................................
..................v.......S................0......
.............v........d.....1.....................
..................................................
..........D....................................0..
...................m.............H..........0.....
...................................d......0.......
..................................................
....Q.............................................
................................H.................
........................H....................8....
..................................................
..................................................
.........................................8........
.......................H3.........................
............................m.....................
................................m.................
Antennas  {"p"=>[[25, 0], [30, 2], [21, 3], [32, 13]], "h"=>[[22, 1], [15, 7], [21, 12], [12, 14]], "C"=>[[27, 1], [47, 4], [46, 8], [44, 9]], "M"=>[[40, 1], [43, 8], [41, 9], [30, 10]], "U"=>[[35, 2], [24, 12], [29, 15], [46, 29]], "5"=>[[2, 3], [3, 6], [7, 9], [12, 10]], "6"=>[[2, 4], [0, 15], [7, 16], [33, 17]], "z"=>[[3, 4], [27, 5], [28, 7], [34, 8]], "c"=>[[15, 5], [9, 6], [14, 10], [18, 13]], "V"=>[[28, 5], [35, 10], [32, 12], [39, 21]], "Z"=>[[1, 7], [2, 10], [8, 11], [13, 14]], "S"=>[[24, 7], [23, 29], [27, 30], [26, 34]], "9"=>[[33, 7], [30, 8], [25, 16], [34, 27]], "O"=>[[1, 8], [2, 9], [9, 11], [4, 12]], "F"=>[[38, 9], [45, 18], [34, 20], [35, 29]], "q"=>[[26, 11], [25, 12], [1, 13], [16, 20]], "s"=>[[0, 12], [1, 15], [4, 17], [21, 22]], "7"=>[[31, 12], [46, 20], [39, 23], [48, 27]], "4"=>[[44, 12], [40, 13], [43, 14], [45, 21]], "g"=>[[3, 13], [2, 20], [4, 23], [5, 24]], "G"=>[[44, 14], [49, 22], [47, 25], [48, 31]], "Q"=>[[31, 15], [33, 16], [30, 20], [4, 41]], "3"=>[[37, 15], [47, 16], [42, 22], [24, 47]], "D"=>[[7, 17], [6, 20], [11, 26], [10, 37]], "L"=>[[46, 18], [39, 20], [41, 21], [38, 25]], "f"=>[[22, 20], [25, 21], [41, 22], [24, 25]], "2"=>[[15, 21], [19, 22], [2, 24]], "v"=>[[32, 23], [25, 24], [18, 34], [13, 35]], "P"=>[[40, 23], [37, 24], [44, 26], [43, 31]], "d"=>[[19, 24], [32, 26], [22, 35], [35, 39]], "1"=>[[45, 24], [37, 27], [38, 32], [28, 35]], "u"=>[[14, 25], [16, 26], [23, 30], [15, 31]], "l"=>[[9, 26], [12, 28], [19, 29], [10, 31]], "o"=>[[41, 26], [44, 27], [43, 29], [48, 32]], "8"=>[[18, 27], [40, 32], [45, 43], [41, 46]], "m"=>[[31, 31], [19, 38], [28, 48], [32, 49]], "0"=>[[43, 34], [47, 37], [44, 38], [42, 39]], "H"=>[[33, 38], [32, 42], [24, 43], [23, 47]]}
Map size  [50, 50]
.#..#.........#.#.#..#...##....#..##.#.#...#.#..#.
.####.....#.#........###.#.#..#.....#..##..#.....#
.#.###.#.#..##......#...##....#.#####.....#....###
..#.##.#.##........#.#...###......#......#.#.#...#
#.##..#####.##..#....#......#....###..##..#.#..###
...#.....#.#...##..........###..##.#...#..#......#
#..###...#.#.##..#.##.#........#.##.#..####....##.
##.#...#..##.#.#......#.#.#.###..##......#..##..#.
.###....#.#....#.#..#...##...##.#.#...##...#.##...
..###..#...#.#...#.#.......###........#.##..#...#.
..##.......##.#...##.#..##.#..###..#.#.####..##...
....#.#.##..##...#.#.#.##.#...#####..#..##.....###
#...##.###.#..#..##..#####.....##.#####.....###...
.###..#.#...#..####.#.#.##.#.#####..##..#...##.#..
.##.##.##...###..###.#.#..####.####.#.##.#.##..##.
##...#####..##.#....####.....#.##....#..###...#...
...##.##.###......#####..####.##.#....#...#.#.##.#
#..##..#..#..##...#.#.#######.####.##.....#.#..#.#
####...##..#....##.###.##.#.#.#...##.###.#...##...
###..#.#....##..#########.#.#.#...#.####......#.#.
###.###..#####..##.##.##...##.#..#####.###.#..#..#
..##..#.###...####..##.#.##........#...#.#######..
...##.#.##...#.#####.#.#...####.##.###.#####.#...#
#...##....#..##.#...#..#....##.###..#..###.#.###..
..#####..#.####..#.##....#.#....#.#####...####.#.#
......##.#.##.#.###.....#....#.#..#..##....#.#.#.#
.#..#.##.###....#.##........#..###########..#.#.##
.##.###.#.#.#.##..###.#.....#..#..#.####...##..###
...#..#######...#..###.###.........#####.#.#.####.
.#.##.#.#.#........#..####.....##..#..##.#.##.####
..#.####..##...##..#...##.####.....#.###..#...#...
#.....#..##.#..##.......####..##.#.....##.##....#.
..#..#.#..##.#.##.##.#...#..###...##..#.#.##.#..#.
.#..##.#..#.#.#...#..###..###.#.#......#.##.#..#..
#..#...####....#..##.#....##.##.###......#.#####..
.####..#.#.###.##.....#...###..##.#.#..##.#....###
.#......#..#.##.###.#.#.#....#..#...#..#..##....#.
#..#..#...##....#.#.##.....#.##...#...##.#.#..##.#
#...#.........#...##.#...#.#...#.#..##..#..##....#
.....#...#.#..#.....#.#..##..#..#..#.##..##.#.##..
....#...#.#.#..#.#...#...###..##.#.#.##.##..#..###
#...#...#...##..##..#.#...#.......##.##.##...##...
#...#.#...#....#.......##.#..#..##.##...#...##..#.
.##...#.#....#...#.#....#....#..#.###......#.####.
...........##...#.###..#.##.#...#...##...#........
.#..#..##..#....#.##...#.###..#.#.##.##.......##..
##.......#.####.....#.##.#.##..#.#....####....#...
.................#..#.###.#.#.....##.#..##......##
.....#...#..#.##.#.....##.#.##.#....#....##.....#.
...........#...#.##.#.#.......####.#.#..#.#...#..#
antinodes [[25, 0], [30, 2], [35, 4], [40, 6], [45, 8], [39, 1], [48, 0], [21, 3], [17, 6], [13, 9], [9, 12], [5, 15], [1, 18], [12, 4], [3, 5], [32, 13], [39, 26], [46, 39], [34, 24], [36, 35], [38, 46], [43, 23], [22, 1], [15, 7], [8, 13], [1, 19], [9, 2], [18, 0], [21, 12], [20, 23], [19, 34], [18, 45], [27, 17], [33, 22], [39, 27], [45, 32], [30, 10], [39, 8], [48, 6], [12, 14], [2, 27], [9, 21], [6, 28], [3, 35], [0, 42], [3, 16], [27, 1], [47, 4], [46, 8], [45, 12], [44, 16], [43, 20], [42, 24], [41, 28], [40, 32], [39, 36], [38, 40], [37, 44], [36, 48], [48, 7], [44, 9], [41, 14], [38, 19], [35, 24], [32, 29], [29, 34], [26, 39], [23, 44], [20, 49], [42, 10], [40, 11], [38, 12], [36, 13], [34, 14], [32, 15], [30, 16], [28, 17], [26, 18], [24, 19], [22, 20], [20, 21], [18, 22], [16, 23], [14, 24], [12, 25], [10, 26], [8, 27], [4, 29], [2, 30], [0, 31], [40, 1], [43, 8], [46, 15], [49, 22], [45, 7], [47, 6], [49, 5], [41, 9], [42, 17], [43, 25], [44, 33], [45, 41], [46, 49], [39, 10], [37, 11], [35, 12], [33, 13], [31, 14], [29, 15], [27, 16], [25, 17], [23, 18], [21, 19], [19, 20], [17, 21], [15, 22], [13, 23], [11, 24], [9, 25], [7, 26], [5, 27], [3, 28], [1, 29], [20, 19], [10, 28], [0, 37], [17, 12], [4, 14], [19, 11], [8, 12], [35, 2], [24, 12], [13, 22], [2, 32], [19, 9], [14, 6], [9, 3], [4, 0], [23, 28], [17, 41], [34, 18], [39, 21], [44, 24], [49, 27], [12, 1], [46, 29], [2, 3], [1, 0], [3, 6], [4, 9], [5, 12], [6, 15], [7, 18], [8, 21], [9, 24], [10, 27], [11, 30], [12, 33], [13, 36], [14, 39], [15, 42], [16, 45], [17, 48], [7, 9], [12, 15], [22, 27], [27, 33], [32, 39], [37, 45], [11, 12], [15, 15], [19, 18], [23, 21], [27, 24], [31, 27], [35, 30], [39, 33], [43, 36], [47, 39], [2, 8], [12, 10], [22, 17], [32, 24], [42, 31], [21, 14], [30, 18], [39, 22], [48, 26], [17, 11], [22, 12], [27, 13], [32, 14], [37, 15], [42, 16], [47, 17], [2, 4], [0, 15], [7, 16], [12, 28], [17, 40], [14, 17], [21, 18], [28, 19], [35, 20], [42, 21], [33, 17], [3, 4], [27, 5], [26, 3], [25, 1], [20, 2], [28, 7], [29, 9], [30, 11], [31, 13], [34, 19], [35, 21], [36, 23], [37, 25], [38, 27], [39, 29], [40, 31], [41, 33], [42, 35], [43, 37], [44, 39], [46, 43], [47, 45], [48, 47], [49, 49], [22, 6], [16, 5], [10, 4], [4, 3], [34, 8], [41, 11], [48, 14], [40, 9], [46, 10], [15, 5], [21, 4], [27, 3], [33, 2], [45, 0], [16, 0], [9, 6], [3, 7], [4, 2], [14, 10], [13, 15], [12, 20], [11, 25], [10, 30], [9, 35], [8, 40], [7, 45], [19, 14], [24, 18], [29, 22], [34, 26], [39, 30], [44, 34], [49, 38], [10, 7], [6, 4], [2, 1], [18, 13], [21, 21], [24, 29], [27, 37], [30, 45], [27, 20], [36, 27], [45, 34], [22, 16], [26, 19], [30, 22], [34, 25], [38, 28], [46, 34], [28, 5], [21, 0], [35, 10], [42, 15], [49, 20], [38, 8], [41, 6], [44, 4], [47, 2], [32, 12], [36, 19], [40, 26], [48, 40], [29, 14], [26, 16], [20, 20], [17, 22], [11, 26], [8, 28], [5, 30], [25, 3], [43, 32], [47, 43], [46, 30], [1, 7], [0, 4], [2, 10], [3, 13], [4, 16], [5, 19], [6, 22], [7, 25], [9, 31], [10, 34], [11, 37], [12, 40], [13, 43], [14, 46], [15, 49], [8, 11], [22, 19], [29, 23], [43, 31], [14, 12], [20, 13], [26, 14], [38, 16], [44, 17], [3, 8], [13, 14], [25, 21], [37, 28], [49, 35], [35, 22], [46, 26], [18, 17], [23, 20], [28, 23], [33, 26], [38, 29], [48, 35], [24, 7], [23, 29], [19, 28], [15, 27], [3, 24], [20, 24], [17, 19], [14, 14], [11, 9], [8, 4], [27, 30], [31, 31], [35, 32], [43, 34], [47, 35], [28, 26], [32, 10], [33, 6], [34, 2], [26, 34], [29, 39], [32, 44], [35, 49], [25, 38], [24, 42], [23, 46], [33, 7], [36, 6], [39, 5], [42, 4], [45, 3], [48, 2], [30, 8], [27, 9], [24, 10], [21, 11], [18, 12], [15, 13], [9, 15], [6, 16], [3, 17], [0, 18], [35, 0], [25, 16], [17, 25], [9, 34], [1, 43], [15, 32], [10, 40], [5, 48], [34, 27], [35, 47], [43, 38], [1, 8], [0, 7], [2, 9], [3, 10], [4, 11], [6, 13], [7, 14], [8, 15], [9, 16], [10, 17], [11, 18], [12, 19], [13, 20], [14, 21], [17, 24], [18, 25], [19, 26], [20, 27], [21, 28], [22, 29], [23, 30], [24, 31], [25, 32], [26, 33], [27, 34], [28, 35], [29, 36], [30, 37], [31, 38], [33, 40], [34, 41], [35, 42], [36, 43], [38, 45], [39, 46], [40, 47], [41, 48], [42, 49], [0, 6], [9, 11], [17, 14], [33, 20], [41, 23], [49, 26], [16, 13], [23, 15], [30, 17], [37, 19], [44, 21], [24, 8], [29, 7], [34, 6], [49, 3], [4, 12], [10, 20], [13, 24], [16, 28], [19, 32], [22, 36], [25, 40], [28, 44], [31, 48], [8, 18], [10, 21], [12, 24], [14, 27], [16, 30], [18, 33], [20, 36], [22, 39], [26, 45], [28, 48], [38, 9], [31, 0], [45, 18], [34, 20], [30, 31], [26, 42], [23, 22], [1, 26], [33, 11], [32, 2], [35, 29], [32, 49], [36, 38], [37, 47], [26, 11], [27, 10], [28, 9], [29, 8], [30, 7], [31, 6], [32, 5], [33, 4], [34, 3], [36, 1], [37, 0], [36, 2], [25, 12], [24, 13], [23, 14], [22, 15], [21, 16], [20, 17], [18, 19], [17, 20], [16, 21], [14, 23], [9, 28], [8, 29], [7, 30], [6, 31], [5, 32], [4, 33], [3, 34], [2, 35], [1, 36], [49, 11], [34, 4], [1, 13], [16, 20], [6, 29], [7, 28], [0, 12], [1, 15], [2, 18], [3, 21], [4, 24], [6, 30], [7, 33], [8, 36], [9, 39], [10, 42], [11, 45], [12, 48], [4, 17], [8, 22], [12, 27], [16, 32], [20, 37], [28, 47], [7, 19], [16, 25], [19, 27], [25, 31], [28, 33], [31, 35], [34, 37], [37, 39], [40, 41], [43, 43], [46, 45], [49, 47], [21, 22], [42, 32], [41, 29], [31, 12], [16, 4], [23, 1], [46, 20], [44, 13], [42, 6], [39, 23], [47, 34], [32, 26], [25, 29], [18, 32], [11, 35], [4, 38], [30, 19], [21, 15], [12, 11], [48, 27], [44, 12], [48, 11], [45, 10], [48, 4], [49, 2], [43, 3], [40, 13], [36, 14], [28, 16], [24, 17], [20, 18], [16, 19], [4, 22], [0, 23], [37, 12], [34, 11], [31, 10], [25, 8], [22, 7], [19, 6], [13, 4], [10, 3], [7, 2], [4, 1], [35, 5], [43, 14], [41, 18], [40, 20], [38, 24], [37, 26], [36, 28], [34, 32], [33, 34], [32, 36], [30, 40], [29, 42], [27, 46], [26, 48], [49, 16], [41, 7], [39, 0], [45, 21], [48, 48], [47, 28], [4, 6], [1, 2], [2, 20], [1, 27], [0, 34], [0, 17], [4, 23], [5, 33], [6, 43], [6, 26], [10, 32], [12, 35], [14, 38], [16, 41], [18, 44], [20, 47], [3, 22], [2, 21], [1, 20], [0, 19], [5, 24], [7, 35], [9, 46], [11, 32], [14, 36], [20, 44], [23, 48], [6, 25], [10, 29], [12, 31], [13, 32], [14, 33], [15, 34], [16, 35], [17, 36], [18, 37], [19, 38], [20, 39], [21, 40], [22, 41], [23, 42], [24, 43], [25, 44], [29, 48], [30, 49], [44, 14], [39, 6], [41, 3], [47, 25], [45, 28], [41, 34], [39, 37], [37, 40], [35, 43], [33, 46], [31, 49], [46, 19], [45, 13], [44, 7], [43, 1], [48, 31], [47, 40], [49, 37], [31, 15], [23, 11], [21, 10], [17, 8], [13, 6], [11, 5], [9, 4], [7, 3], [5, 2], [3, 1], [33, 5], [34, 0], [33, 16], [35, 17], [37, 18], [39, 19], [41, 20], [43, 21], [45, 22], [47, 23], [49, 24], [36, 12], [30, 20], [29, 25], [28, 30], [27, 35], [26, 40], [25, 45], [24, 28], [21, 32], [18, 36], [15, 40], [12, 44], [9, 48], [4, 41], [27, 14], [17, 13], [7, 12], [32, 8], [47, 16], [42, 22], [47, 29], [32, 34], [27, 40], [22, 46], [24, 47], [7, 17], [8, 14], [10, 8], [12, 2], [6, 20], [5, 23], [4, 26], [3, 29], [1, 35], [0, 38], [1, 14], [15, 35], [19, 44], [21, 38], [26, 44], [10, 37], [46, 18], [39, 20], [32, 22], [25, 24], [18, 26], [11, 28], [4, 30], [35, 18], [31, 16], [25, 13], [23, 12], [19, 10], [17, 9], [15, 8], [13, 7], [11, 6], [9, 5], [7, 4], [5, 3], [3, 2], [1, 1], [40, 15], [41, 10], [42, 5], [43, 0], [41, 21], [36, 24], [26, 30], [21, 33], [16, 36], [11, 39], [6, 42], [1, 45], [43, 22], [45, 23], [47, 24], [49, 25], [47, 13], [38, 25], [30, 32], [37, 30], [35, 40], [34, 45], [32, 33], [29, 37], [26, 41], [23, 45], [19, 19], [16, 18], [13, 17], [10, 16], [7, 15], [3, 18], [20, 15], [18, 10], [14, 0], [28, 22], [31, 23], [43, 27], [46, 28], [49, 29], [9, 20], [26, 17], [29, 5], [30, 1], [41, 22], [24, 25], [32, 45], [22, 33], [21, 37], [20, 41], [19, 45], [18, 49], [15, 21], [11, 20], [28, 18], [41, 15], [19, 22], [23, 23], [31, 25], [35, 26], [43, 28], [36, 20], [2, 24], [32, 23], [46, 21], [46, 12], [4, 27], [39, 4], [37, 13], [18, 34], [4, 45], [11, 44], [23, 33], [28, 32], [33, 31], [38, 30], [43, 29], [48, 28], [13, 35], [1, 46], [3, 37], [40, 23], [32, 17], [28, 14], [24, 11], [20, 8], [34, 7], [37, 24], [31, 26], [28, 27], [25, 28], [19, 30], [16, 31], [10, 33], [7, 34], [4, 35], [2, 14], [31, 17], [25, 10], [19, 3], [44, 26], [48, 29], [46, 16], [47, 11], [49, 1], [42, 36], [41, 41], [40, 46], [19, 24], [13, 2], [3, 9], [29, 13], [26, 0], [22, 35], [25, 46], [35, 39], [48, 43], [45, 24], [37, 27], [29, 30], [5, 39], [36, 22], [34, 12], [38, 32], [31, 40], [24, 48], [40, 42], [41, 47], [11, 46], [19, 43], [18, 38], [8, 41], [14, 25], [10, 23], [6, 21], [4, 20], [2, 19], [5, 20], [13, 19], [12, 13], [11, 7], [10, 1], [16, 26], [18, 27], [20, 28], [24, 30], [26, 31], [30, 33], [34, 35], [36, 36], [38, 37], [40, 38], [42, 39], [44, 40], [46, 41], [48, 42], [9, 22], [18, 16], [20, 6], [21, 1], [32, 35], [41, 40], [30, 34], [37, 38], [44, 42], [31, 29], [39, 28], [47, 27], [15, 31], [16, 37], [17, 43], [13, 41], [12, 46], [7, 32], [9, 26], [6, 24], [0, 20], [6, 11], [5, 6], [15, 30], [21, 34], [24, 36], [27, 38], [33, 42], [36, 44], [42, 48], [16, 22], [20, 16], [22, 13], [26, 7], [28, 4], [19, 29], [29, 32], [39, 35], [47, 33], [46, 23], [10, 31], [11, 36], [12, 41], [13, 46], [8, 34], [6, 37], [4, 40], [2, 43], [0, 46], [1, 33], [41, 26], [26, 21], [17, 18], [11, 16], [5, 14], [2, 13], [37, 20], [33, 14], [31, 11], [25, 2], [44, 27], [45, 25], [47, 21], [48, 19], [49, 17], [40, 22], [36, 17], [24, 2], [40, 35], [38, 39], [37, 41], [35, 45], [34, 47], [33, 49], [38, 26], [33, 23], [28, 20], [23, 17], [18, 14], [13, 11], [8, 8], [48, 32], [39, 18], [38, 4], [45, 43], [49, 40], [41, 46], [37, 49], [43, 24], [30, 13], [6, 27], [20, 46], [8, 43], [4, 42], [0, 41], [39, 31], [35, 28], [27, 22], [23, 19], [19, 16], [11, 10], [7, 7], [42, 30], [38, 14], [37, 10], [44, 29], [47, 14], [48, 9], [49, 4], [47, 37], [44, 38], [45, 42], [46, 46], [41, 39], [35, 41], [32, 42], [29, 43], [17, 47], [14, 48], [11, 49], [46, 37], [48, 36], [41, 44], [40, 49], [32, 43], [27, 45], [22, 47], [17, 49], [40, 40], [38, 41], [36, 42], [34, 43], [28, 46], [26, 47], [22, 49], [33, 38], [34, 34], [36, 26], [37, 22], [38, 18], [39, 14], [40, 10], [42, 2], [42, 33], [31, 46], [41, 37], [15, 48], [16, 44], [8, 45], [25, 39], [26, 35], [27, 31], [32, 11], [23, 47]]
result    1067
#+end_example
